{-# LANGUAGE OverloadedStrings #-}

import Sound.Tidal.Context

-- [C, C#, D, D#, E, F, F#, G, G#, A, A#, B,  C ]
-- [0, 1,  2, 3,  4, 5, 6,  7, 8,  9, 10, 11, 12]

-- chords:

-- major:

-- Δ
-- Δ2
-- Δ4
-- Δ(#5)
-- Δ(# 5,9)
-- Δ6
-- Δ9
-- Δ6(9)
-- Δ6(9, #11)
-- Δ7
-- Δ7(#5)
-- Δ7(9)
-- Δ7(#11)
-- Δ7(13)
-- Δ7(9,13)
-- Δ7(9,#11,13)

-- minor

-- m
-- m2
-- m6
-- m(b6)
-- m9
-- m6(9)
-- m7
-- m7(9)
-- m7(11)
-- m7(13)
-- m7(9,11)
-- m7(9,13)
-- m7(11,13)
-- m7(9,11,13)
-- mΔ7
-- mΔ7(9)

-- dominant

-- 7
-- 7(9)

-- diminish

major x = stack [n x, n (x + 7), n (x + 12)]